[
  {
    "title": "Tally Ai",
    "subtitle": "Redesign user flow to bring in new customers, and restaurant owners to an inviting website.",
    "url": null,
    "slug": "tally-ai",
    "image": "./images/tally_ai_logo.png",
    "image_mobile": "./images/tally_ai_logo.png",
    "image_desktop": "./images/tally_ai_desktop.png",
    "description": "I was tasked to work in a team of 10 people, consiting of 2 ux designers, and 8 developers to update an application. I worked on this during school on a time frame of 3 months. My tasks consisted working on the user settings page and handling the search tab and quering restaurant data quickly.",
    "documentation": [
      {
        "element": "p",
        "text": "Tally Ai was created before by a team of lambda developers that were fulfilling an idea from stakeholders. The idea was to assist small businesses to sort through many reviews, currently from yelp data set, to get useful data out of them. It would help them make informed business decisions, especially regarding business expansion."
      },
      {
        "element": "p",
        "text": "The previous team was using Material UI for design and we decided to expand on that. For the settings page, I followed the design given to me by the ux designers. I styled the account settings based on the user flow for easier user setting navigation changes."
      },
      { "element": "h2", "text": "Updates" },
      {
        "element": "p",
        "text": "Worked on a better filtering system for restaurant owners to compare and contrast what their competitors are doing better and what owners can improve on. Updated the backend to use a data set provided by yelp where it was quicker to access and with no limit restrictions compared to the Yelp API that was previously used."
      },
      { "element": "h2", "text": "Conclusion" },
      {
        "element": "p",
        "text": "Working on the frontend and backend for Tally AI was so satisfying. I styled the layout to the exact design given to me by the UX designers. Removing the previous Yelp API made the site load faster when users search for restaurants. With what I learned from school I was able to successfully take over a continued project and complete what was requested."
      }
    ],
    "technologies": [
      "React",
      "Redux",
      "Material UI",
      "AWS",
      "PostgresSQL",
      "Cypress Testing",
      "Github"
    ],
    "roadmap": "",
    "credits": ""
  },
  {
    "title": "Tacos El Rojo",
    "subtitle": "Simple and clean website that is easy to maintain.",
    "url": "https://tacos-el-rojo.now.sh/",
    "slug": "tacos-el-rojo",
    "image": "./images/tacos_el_rojo_logo.jpg",
    "image_mobile": "./images/tacos_el_rojo_mobile.jpg",
    "image_desktop": "./images/tacos_el_rojo_desktop.png",
    "description": "I assited a good friend on creating a simple layout and design for his taco catering business. It allowed new customer to get a glimpse of what he had to offer and bring in new customers.",
    "documentation": [
      {
        "element": "p",
        "text": "Tacos El Rojo is a small taco shop, catering business that is owned by a friend of mine. He was looking to get a simple website to show his new potential customer on his menu and ways to contact him. I had full ux design responsibilities to make it loop most appealing with his personal logo."
      },
      { "element": "h2", "text": "Fast & Clean" },
      {
        "element": "p",
        "text": "I used tailwind for styling to quickly and efficiently give the website a clean look. It was my first time using tailwind but it was easy to set up and style the website. It is designed on mobile first approach since most visitors were mobile users."
      },
      {
        "element": "p",
        "text": "The owner of Tacos El Rojo was very proud of his logo and his only request was to have it front and center. I used it as a background for all the pages. I will be redesigning it at a later time for him since I did state that I look like the page has not content with only a large logo. The website only shows his manu and customers have to call in their order. When he expands that logo will be getting smaller and more options to order."
      },
      { "element": "h2", "text": "Conclusion" },
      {
        "element": "p",
        "text": "I created this website free of charge and was able to complete it within one month. Using tailwind, made it possible to have a mobile responsive website while still looking clean. I am looking forward to expanding on new ideas that can bring in more revenue for Tacos El Rojo."
      }
    ],
    "technologies": ["React", "Tailwind CSS", "Github"],
    "roadmap": "",
    "credits": ""
  },
  {
    "title": "Game Of Life",
    "subtitle": "Conway's game of life",
    "url": "https://gameoflife.adrianbparra.com/",
    "slug": "game-of-life",
    "image": "./images/game_of_life_logo.png",
    "image_mobile": "./images/game_of_life_mobile.jpg",
    "image_desktop": "./images/game_of_life_desktop.jpg",
    "description": "I created a simple game of life game during my school time using React. It is based of John Conway's Game of Life",
    "documentation": [
      {
        "element": "p",
        "text": "The firt version was created just with useState management while short after it was updated to use React hooks. State and actions was better managed with useReducer and useContext"
      },
      { "element": "h2", "text": "Resizable" },
      {
        "element": "p",
        "text": "It is not only mobile friendly it has the option resize the game board as well. It resizes from a size 4x4 to 50x50 board."
      },
      { "element": "h2", "text": "Generations" },
      {
        "element": "p",
        "text": "It has the option to generate sample generations from Still Lifes, Oscillators, and Spaceships. While creating the game it allowed me to learn the proper ways on updating cells properly."
      },
      { "element": "h2", "text": "Conclusion" },
      {
        "element": "p",
        "text": "This was a very fun game to create and style. Was very usefull learning to update the cells depending on neigbor cells."
      }
    ],
    "technologies": ["React", "CSS"],
    "roadmap": "",
    "credits": ""
  }
]
